Software Studio/TeamNote/app/controllers/alcs_controller.rb

SELECT "alcs".* FROM "alcs"
---
  def index
    @alcs = Alc.all

SELECT "users".* FROM "users" WHERE "users"."user_name" = 'user_test' LIMIT 1
INSERT INTO "alcs" ("created_at", "note_id", "read", "updated_at", "user_id", "write") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 17 Oct 2013 22:27:19 UTC +00:00], ["note_id", 15], ["read", true], ["updated_at", Thu, 17 Oct 2013 22:27:19 UTC +00:00], ["user_id", 8], ["write", false]]
---
  def create
    givenUserName = params[:alc][:user_name]
    user = User.where(user_name: givenUserName).take
    @alc = Alc.new(alc_params.merge(:user_id => user.id))

    respond_to do |format|
      if @alc.save