Software Studio/TeamNote/app/controllers/notes_controller.rb

  def index
    @authoredNotes = current_user.notes
    @viewNotes = []
    @editNotes = []
    @authoredNotes.each do |note|
      alcs = Alc.where(note_id: note.id, user_id: current_user.id)
      alcs.each do |alc|
---
SELECT "notes".* FROM "notes" INNER JOIN "alcs" ON "notes"."id" = "alcs"."note_id" WHERE "alcs"."user_id" = ? AND (read = 't' AND write = 't')  [["user_id", 5]]
SELECT "alcs".* FROM "alcs" WHERE "alcs"."note_id" = 10 AND "alcs"."user_id" = 5
SELECT "alcs".* FROM "alcs" WHERE "alcs"."user_id" = ?  [["user_id", 5]]

  def show
    @editors = []
    @viewers = []
    for alc in @note.alcs
      if alc.write
        @editors.push(User.find(alc.user_id).user_name)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]

  def create
    @note = Note.new(note_params.merge(:user_id => current_user.id))
    respond_to do |format|
      if @note.save
        author = Alc.create(user_id: current_user.id, note_id: @note.id, read: true, write: true)
---
INSERT INTO "notes" ("content", "created_at", "subject", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "cool"], ["created_at", Sun, 06 Oct 2013 20:38:23 UTC +00:00], ["subject", "test"], ["updated_at", Sun, 06 Oct 2013 20:38:23 UTC +00:00], ["user_id", 5]]
INSERT INTO "alcs" ("created_at", "note_id", "read", "updated_at", "user_id", "write") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 06 Oct 2013 20:45:07 UTC +00:00], ["note_id", 10], ["read", true], ["updated_at", Sun, 06 Oct 2013 20:45:07 UTC +00:00], ["user_id", 5], ["write", true]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "subject" = ?, "content" = ?, "updated_at" = ? WHERE "notes"."id" = 14  [["subject", "Test"], ["content", "Testing"], ["updated_at", Tue, 15 Oct 2013 21:27:54 UTC +00:00]]

  def destroy
    @note.destroy
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 11]]

    def set_note
      @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "11"]]