Software Studio/TeamNote/app/controllers/users_controller.rb

 	def create
  		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("created_at", "password_hash", "password_salt", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)